tap "homebrew/bundle"
brew "bat"
brew "difftastic"
brew "direnv"
brew "eza"
brew "fastfetch"
brew "fnm"
brew "fzf"
brew "git-delta"
brew "lazydocker"
brew "lazygit"
brew "neovim"
brew "oh-my-posh"
brew "uv"
brew "yazi"
brew "zoxide"

brew "go"
brew "juliaup"
