{
  "$schema": "https://aka.ms/winget-packages.schema.2.0.json",
  "title": "Winget - Development Environment",
  "Sources": [
    {
      "Packages": [
        { "PackageIdentifier": "Anthropic.ClaudeCode" },
        { "PackageIdentifier": "DBeaver.DBeaver.Community" },
        { "PackageIdentifier": "Docker.DockerDesktop" },
        { "PackageIdentifier": "Git.Git" },
        { "PackageIdentifier": "GitHub.cli" },
        { "PackageIdentifier": "GnuWin32.Which" },
        { "PackageIdentifier": "Microsoft.PowerShell" },
        { "PackageIdentifier": "Microsoft.VisualStudioCode" },
        { "PackageIdentifier": "Schniz.fnm" },
        { "PackageIdentifier": "SuperCuber.Dotter" },
        { "PackageIdentifier": "Tailscale.Tailscale" },
        { "PackageIdentifier": "ZedIndustries.Zed" },
        { "PackageIdentifier": "jdx.mise" }
      ],
      "SourceDetails": {
        "Argument": "https://cdn.winget.microsoft.com/cache",
        "Identifier": "Microsoft.Winget.Source_8wekyb3d8bbwe",
        "Name": "winget",
        "Type": "Microsoft.PreIndexed.Package"
      }
    }
  ]
}
